<template>
  <main>
    <div class="bg-white rounded-lg p-4 leading-8">
      <p>尊敬的用户：</p>
      <p class="mt-8">
        欢迎您使用我们的网站服务！为了确保您能够充分了解并遵守我们的服务规则，特此制定本协议。请您在使用我们的网站服务前，仔细阅读并理解以下内容。
      </p>
      <p class="mt-8">一、服务范围</p>
      <p>
        我们的网站服务包括但不限于信息浏览、发布、交流、购物、支付等。我们致力于为您提供一个安全、便捷、高效的在线平台，以满足您的多样化需求。
      </p>
      <p class="mt-8">二、用户资格</p>
      <p>
        您在使用我们的服务时，应确保自己具备完全民事行为能力，能够对自己的行为负责。
      </p>
      <p>
        若您为未成年人，应在家长或监护人的陪同下使用我们的服务，并遵守相关法律法规的规定。
      </p>
      <p class="mt-8">三、用户行为</p>
      <p>
        您在使用我们的服务时，应遵守国家法律法规、社会公德及本协议的规定，不进行任何违法、侵权或干扰网站正常运营的行为。
      </p>
      <p>
        您不得发布或传播任何违法、色情、暴力、恐怖、迷信、欺诈、诽谤、侵犯他人隐私等内容。
      </p>
      <p>您应尊重他人的知识产权，不得擅自复制、传播或修改他人的作品。</p>
      <p>
        您在使用我们的服务时，应确保自己的账户安全，不得将账户密码泄露给他人，也不得使用他人的账户进行非法操作。
      </p>
      <p class="mt-8">四、信息保护</p>
      <p>
        我们将采取合理的技术措施和管理措施，保护您的个人信息和交易安全。但请注意，由于网络环境的复杂性和不可预测性，我们无法完全保证您的信息绝对安全。因此，您在使用我们的服务时，应自行承担一定的信息安全风险。
      </p>
      <p>
        您在使用我们的服务时，应妥善保管自己的个人信息和账户密码，不得将个人信息泄露给他人，也不得使用他人的个人信息进行非法操作。
      </p>
      <p class="mt-8">五、服务费用</p>
      <p>
        我们提供的部分服务可能需要您支付一定的费用。具体费用标准和支付方式将在服务页面明确标注。
      </p>
      <p>
        您在使用需要支付费用的服务时，应确保自己的账户余额充足或已绑定了有效的支付方式。若因您的账户余额不足或支付方式无效导致服务无法正常使用，我们将不承担任何责任。
      </p>
      <p class="mt-8">六、服务变更与终止</p>
      <p>
        我们有权根据法律法规的变化、业务发展的需要或用户反馈，对服务进行变更或终止。变更或终止服务的具体时间和方式将在我们的官方网站上公布，并通过适当的方式通知您。
      </p>
      <p>
        若您对我们的服务变更或终止有异议，可以与我们联系并表达您的意见。但请注意，我们的决定是最终的，您应自行承担因服务变更或终止而产生的任何损失。
      </p>
      <p class="mt-8">七、违约责任</p>
      <p>
        若您在使用我们的服务时违反了本协议的规定，我们有权采取警告、限制功能、暂停服务、终止服务、追究法律责任等措施。
      </p>
      <p>若我们的服务因您的过错而遭受损失，您应承担相应的赔偿责任。</p>
      <p class="mt-8">八、争议解决</p>
      <p>
        本协议的解释、效力及争议解决均适用中华人民共和国法律。若因本协议引起的或与本协议有关的任何争议，双方应首先通过友好协商解决；协商不成的，任何一方均有权向有管辖权的法院提起诉讼。
      </p>
      <p></p>
    </div>
  </main>
</template>
