<template>
  <main>
    <div class="bg-white rounded-lg p-4 leading-8">
      <p>尊敬的用户：</p>
      <p class="mt-8">
        我们深知您的隐私安全至关重要，因此特此发布本隐私保护指引，旨在向您阐述我们如何收集、使用、存储及保护您的个人信息。请您在使用我们的服务前，仔细阅读并理解以下内容。
      </p>
      <p class="mt-8">一、信息收集</p>
      <p>
        基本信息：在您注册或使用我们的服务时，我们可能需要您提供基本信息，如姓名、性别、年龄、电子邮箱地址、手机号码等。这些信息是为您提供服务所必需的。
      </p>
      <p>
        日志信息：当您使用我们的服务时，我们可能会自动收集您的使用日志，包括但不限于IP地址、访问时间、访问页面、设备型号、操作系统等。这些信息有助于我们了解用户的使用习惯，从而优化服务。
      </p>
      <p>
        位置信息：若您在使用我们的服务时开启了定位功能，我们可能会收集您的位置信息，以便为您提供基于位置的服务。
      </p>
      <p class="mt-8">二、信息使用</p>
      <p>
        提供服务：我们将使用您的信息来为您提供服务，包括但不限于注册登录、信息推送、个性化推荐等。
      </p>
      <p>
        提升服务：我们可能会将您的信息用于数据分析，以了解用户的使用习惯，从而提升服务质量。
      </p>
      <p>
        满足法律法规：我们可能会根据法律法规的要求，使用您的信息以满足相应的合规要求。
      </p>
      <p>
        其他用途：在得到您的明确同意后，我们可能会将您的信息用于其他合法用途。
      </p>
      <p class="mt-8">三、信息安全</p>
      <p>
        加密存储：我们将采用先进的加密技术对您的信息进行加密存储，以防止信息泄露。
      </p>
      <p>
        访问控制：我们将对访问您信息的员工进行严格的权限管理，确保只有经过授权的人员才能访问您的信息。
      </p>
      <p>
        安全审计：我们将定期对系统进行安全审计，及时发现并修复潜在的安全漏洞。
      </p>
      <p class="mt-8">四、信息共享与披露</p>
      <p>
        第三方服务：若我们与第三方合作提供服务，我们将与第三方签订保密协议，确保您的信息不被泄露。但在某些情况下，如法律法规要求或您授权，我们可能会向第三方提供您的信息。
      </p>
      <p>
        公共披露：我们可能会对部分信息进行公共披露，如用户数量、使用情况等，但这些信息将不包含您的个人身份标识。
      </p>
      <p class="mt-8">五、您的权利</p>
      <p>访问信息：您有权随时访问并查看我们收集的您的信息。</p>
      <p>更正信息：若您发现我们收集的您的信息有误，您有权要求我们更正。</p>
      <p>
        删除信息：在特定情况下，如您不再使用我们的服务或我们违反法律法规，您有权要求我们删除您的信息。
      </p>
      <p>
        撤回同意：您有权随时撤回对我们的信息使用同意。撤回同意后，我们将停止使用您的信息，但在此之前已进行的信息处理将不受影响。
      </p>
      <p class="mt-8">六、隐私政策更新</p>
      <p>
        我们可能会根据法律法规的变化、业务发展的需要或用户反馈，对隐私政策进行更新。
      </p>
      <p>
        更新后的隐私政策将在我们的官方网站上公布，并通过适当的方式通知您。若您继续使用我们的服务，即表示您同意更新后的隐私政策。
        我们承诺将持续致力于保护您的隐私安全，为您提供更加安全、便捷的服务。
      </p>
      <p>
        若您对我们的隐私保护有任何疑问或建议，请随时与我们联系。
        感谢您的信任与支持！
      </p>
    </div>
  </main>
</template>
