export default {
  message: {
    wei: '微',
    hu: '乎',
    home: '首页',
    creativeCenter: '创作中心',
    circleOfFriends: '朋友圈',
    searchContent: '输入要搜索的内容...',
    search: '搜索',
    message: '消息',
    privateLetter: '私信',
    homePage: '主页',
    setting: '设置',
    logout: '退出',
    logoutSuccess: '退出成功',
    logoutFail: '退出失败',
    praise: '点赞',
    comment: '评论',
    follow: '关注',
    about: '关于',
    viewAllNotifications: '查看所有通知',
    myPrivateMessage: '我的私信',
    viewAllPrivateMessages: '查看所有私信',
    uploadHomeBg: '上传主页背景图',
    post: '发帖',
    ask: '提问',
    fans: '粉丝',
    collect: '收藏',
    share: '分享',
    edit: '编辑个人资料',
    gender: '性别',
    dateOfBirth: '出生日期',
    live: '居住地',
    individualResume: '个人简介',
    enterIndividualResume: '输入200字以内的个人简介',
    email: '邮箱',
    password: '密码',
    registrationDate: '注册日期',
    modify: '修改',
    return: '返回我的主页',
    emailLogin: '邮箱登录',
    passwordLogin: '密码登录',
    enterQQOr163: '输入QQ/163邮箱',
    enterPassword: '输入密码',
    enterAuthCode: '输入验证码',
    getAuthCode: '获取验证码',
    feedbackError: '反馈错误',
    forgetPassword: '忘记密码',
    login: '登录',
    otherLogin: '其他登录方式',
    remind: '未注册手机验证后自动登录，注册即代表同意',
    protocol: '<协议>',
    privacy: '<隐私保护指引>',
    afterSeconds: '{seconds}秒后可重发',
    ipAddress: 'ip属地',
    cancel: '取消',
    save: '保存',
    nickname: '用户名',
    male: '男',
    female: '女',
    other: '其他',
    nextStep: '下一步',
    showIp: '展示IP属地',
    showFan: '展示粉丝',
    showFollow: '展示关注',
    showShare: '展示分享',
    showPraise: '展示点赞',
    showCollect: '展示收藏',
    showLive: '展示居住地',
    showFriend: '展示朋友',
    privateMessageRange: '私信范围',
    circleOfFriendsVisibleRange: '朋友圈可见范围',
    postVisibility: '发帖可见范围',
    allVisible: '全部可见',
    visibleOnly: '仅自己可见',
    visibleThree: '三天内可见',
    visibleWeek: '一周内可见',
    visibleMonth: '一月内可见',
    visibleHalfYear: '半年内可见',
    visibleYear: '一年内可见',
    chatAll: '全部人可私信',
    chatFriend: '仅好友可私信',
    chatFollowFriend: '关注/好友可私信',
    chatFollowFanFriend: '关注/粉丝/好友可私信',
    chatNone: '不可私信',
    modifySuccess: '修改成功',
    modifyError: '修改失败',
    uploadSuccess: '上传成功',
    uploadError: '上传失败',
    authCodeError: '验证码错误',
    pickDate: '选择日期',
    select: '选择',
    enterOriginalEmail: '输入原邮箱',
    enterNewEmail: '输入新邮箱(QQ/163)',
    enterEmail: '输入邮箱',
    enterOldPassword: '输入原密码',
    enterNewPassword: '输入6-20位的新密码',
    oldPasswordError: '原密码错误',
    newPasswordLength: '新密码长度必须为6-20位',
    getAuthCodeSuccess: '获取验证码成功',
    getAuthCodeError: '获取验证码失败',
    enterOldEmail: '输入原邮箱',
    emailEmpty: '邮箱不能为空',
    emailFormatError: '邮箱格式错误',
    authCodeEmpty: '验证码不能为空',
    loginSuccess: '登录成功',
    emailAuthCodeError: '邮箱或验证码错误',
    emailPasswordError: '邮箱或密码错误',
    highest: '最高',
    lowest: '最低',
    year: '年',
    month: '月',
    day: '日',
    Monday: '星期一',
    Tuesday: '星期二',
    Wednesday: '星期三',
    Thursday: '星期四',
    Friday: '星期五',
    Saturday: '星期六',
    Sunday: '星期日',
    refresh: '刷新',
    passwordEmpty: '密码不能为空',
    404: '404 - 页面未找到',
    remind404:
      '抱歉，您访问的页面似乎不存在。请检查URL是否正确。或根据header回到网站。',
    commit: '提交',
    commitErrorLogEmpty: '未填写反馈内容',
    commitErrorLogSuccess: '反馈成功',
    commitErrorLogError: '反馈失败',
    feedbackErrorContent: '输入需要反馈的错误内容',
    newPassword: '输入6-20位新密码',
    newPasswordAgain: '再次输入新密码',
    newPasswordEmpty: '新密码不能为空',
    newPasswordAgainEmpty: '再次输入密码',
    newPasswordNotEqual: '两次密码不一致',
    aboutContent: {
      title: '关于微乎',
      welcome:
        '欢迎来到微乎，一个致力于连接你我、分享生活点滴、探索无限可能的网络社交平台。在这里，每个人都可以找到属于自己的声音，与志同道合的朋友相遇，共同创造一个更加多彩、温暖的世界。',
      vision: {
        title: '我们的愿景',
        content:
          '微乎的愿景是成为全球领先的社交平台，让每个人都能轻松分享自己的故事，发现世界的多样性和美好。我们希望通过技术的力量，打破地域和文化的界限，让每一个独特的个体都能在这个平台上找到归属感。'
      },
      mission: {
        title: '我们的使命',
        items: [
          '促进交流：提供一个安全、友善的环境，鼓励用户之间的真诚交流和分享。',
          '激发创意：激发用户的创造力和想象力，让每个人都能成为内容的创造者和传播者。',
          '传递价值：通过分享和传播有价值的内容，提升用户的知识水平、审美能力和社会责任感。'
        ]
      },
      features: {
        title: '平台功能',
        items: [
          '个性化主页：用户可以创建自己的个性化主页，展示个人风采和兴趣爱好。',
          '动态分享：支持文字、图片、视频等多种形式的动态分享，记录生活的每一个精彩瞬间。',
          '互动交流：通过点赞、评论、私信等功能，与其他用户建立联系，分享彼此的看法和感受。',
          '发现新朋友：基于兴趣、地理位置等维度，发现新朋友和有趣的社群。'
        ]
      },
      privacy: {
        title: '隐私政策与用户协议',
        content:
          '我们非常重视用户的隐私和数据安全。请仔细阅读我们的[隐私政策]和[用户协议]，了解我们如何收集、使用和保护您的个人信息。'
      },
      closing:
        '微乎是一个不断成长的社区，我们期待您的加入和贡献。无论您是寻找新朋友、分享生活点滴，还是寻找灵感和机会，这里都有属于您的舞台。让我们一起创造更多可能，共同书写属于我们的精彩故事！'
    },
    privacyContent: {
      title: '隐私保护指引',
      content: `
      <p>尊敬的用户：</p>
      <p class="mt-8">
        我们深知您的隐私安全至关重要，因此特此发布本隐私保护指引，旨在向您阐述我们如何收集、使用、存储及保护您的个人信息。请您在使用我们的服务前，仔细阅读并理解以下内容。
      </p>
      <p class="mt-8">一、信息收集</p>
      <p>
        基本信息：在您注册或使用我们的服务时，我们可能需要您提供基本信息，如姓名、性别、年龄、电子邮箱地址、手机号码等。这些信息是为您提供服务所必需的。
      </p>
      <p>
        日志信息：当您使用我们的服务时，我们可能会自动收集您的使用日志，包括但不限于IP地址、访问时间、访问页面、设备型号、操作系统等。这些信息有助于我们了解用户的使用习惯，从而优化服务。
      </p>
      <p>
        位置信息：若您在使用我们的服务时开启了定位功能，我们可能会收集您的位置信息，以便为您提供基于位置的服务。
      </p>
      <p class="mt-8">二、信息使用</p>
      <p>
        提供服务：我们将使用您的信息来为您提供服务，包括但不限于注册登录、信息推送、个性化推荐等。
      </p>
      <p>
        提升服务：我们可能会将您的信息用于数据分析，以了解用户的使用习惯，从而提升服务质量。
      </p>
      <p>
        满足法律法规：我们可能会根据法律法规的要求，使用您的信息以满足相应的合规要求。
      </p>
      <p>
        其他用途：在得到您的明确同意后，我们可能会将您的信息用于其他合法用途。
      </p>
      <p class="mt-8">三、信息安全</p>
      <p>
        加密存储：我们将采用先进的加密技术对您的信息进行加密存储，以防止信息泄露。
      </p>
      <p>
        访问控制：我们将对访问您信息的员工进行严格的权限管理，确保只有经过授权的人员才能访问您的信息。
      </p>
      <p>
        安全审计：我们将定期对系统进行安全审计，及时发现并修复潜在的安全漏洞。
      </p>
      <p class="mt-8">四、信息共享与披露</p>
      <p>
        第三方服务：若我们与第三方合作提供服务，我们将与第三方签订保密协议，确保您的信息不被泄露。但在某些情况下，如法律法规要求或您授权，我们可能会向第三方提供您的信息。
      </p>
      <p>
        公共披露：我们可能会对部分信息进行公共披露，如用户数量、使用情况等，但这些信息将不包含您的个人身份标识。
      </p>
      <p class="mt-8">五、您的权利</p>
      <p>访问信息：您有权随时访问并查看我们收集的您的信息。</p>
      <p>更正信息：若您发现我们收集的您的信息有误，您有权要求我们更正。</p>
      <p>
        删除信息：在特定情况下，如您不再使用我们的服务或我们违反法律法规，您有权要求我们删除您的信息。
      </p>
      <p>
      撤回同意：您有权随时撤回对我们的信息使用同意。撤回同意后，我们将停止使用您的信息，但在此之前已进行的信息处理将不受影响。
      </p>
      <p class="mt-8">六、隐私政策更新</p>
      <p>
        我们可能会根据法律法规的变化、业务发展的需要或用户反馈，对隐私政策进行更新。
      </p>
      <p>
        更新后的隐私政策将在我们的官方网站上公布，并通过适当的方式通知您。若您继续使用我们的服务，即表示您同意更新后的隐私政策。
        我们承诺将持续致力于保护您的隐私安全，为您提供更加安全、便捷的服务。
      </p>
      <p>
        若您对我们的隐私保护有任何疑问或建议，请随时与我们联系。
        感谢您的信任与支持！
      </p>`
    },
    protocolContent: {
      title: '用户协议',
      content: `
        <p>尊敬的用户：</p>
        <p class="mt-4">
          欢迎您使用我们的网站服务！为了确保您能够充分了解并遵守我们的服务规则，特此制定本协议。请您在使用我们的网站服务前，仔细阅读并理解以下内容。
        </p>
        <p class="mt-8">一、服务范围</p>
        <p>
          我们的网站服务包括但不限于信息浏览、发布、交流、购物、支付等。我们致力于为您提供一个安全、便捷、高效的在线平台，以满足您的多样化需求。
        </p>
        <p class="mt-8">二、用户资格</p>
        <p>
          您在使用我们的服务时，应确保自己具备完全民事行为能力，能够对自己的行为负责。
        </p>
        <p>
          若您为未成年人，应在家长或监护人的陪同下使用我们的服务，并遵守相关法律法规的规定。
        </p>
        <p class="mt-8">三、用户行为</p>
        <p>
          您在使用我们的服务时，应遵守国家法律法规、社会公德及本协议的规定，不进行任何违法、侵权或干扰网站正常运营的行为。
        </p>
        <p>
          您不得发布或传播任何违法、色情、暴力、恐怖、迷信、欺诈、诽谤、侵犯他人隐私等内容。
        </p>
        <p>您应尊重他人的知识产权，不得擅自复制、传播或修改他人的作品。</p>
        <p>
          您在使用我们的服务时，应确保自己的账户安全，不得将账户密码泄露给他人，也不得使用他人的账户进行非法操作。
        </p>
        <p class="mt-8">四、信息保护</p>
        <p>
          我们将采取合理的技术措施和管理措施，保护您的个人信息和交易安全。但请注意，由于网络环境的复杂性和不可预测性，我们无法完全保证您的信息绝对安全。因此，您在使用我们的服务时，应自行承担一定的信息安全风险。
        </p>
        <p>
          您在使用我们的服务时，应妥善保管自己的个人信息和账户密码，不得将个人信息泄露给他人，也不得使用他人的个人信息进行非法操作。
        </p>
        <p class="mt-8">五、服务费用</p>
        <p>
          我们提供的部分服务可能需要您支付一定的费用。具体费用标准和支付方式将在服务页面明确标注。
        </p>
        <p>
          您在使用需要支付费用的服务时，应确保自己的账户余额充足或已绑定了有效的支付方式。若因您的账户余额不足或支付方式无效导致服务无法正常使用，我们将不承担任何责任。
        </p>
        <p class="mt-8">六、服务变更与终止</p>
        <p>
          我们有权根据法律法规的变化、业务发展的需要或用户反馈，对服务进行变更或终止。变更或终止服务的具体时间和方式将在我们的官方网站上公布，并通过适当的方式通知您。
        </p>
        <p>
          若您对我们的服务变更或终止有异议，可以与我们联系并表达您的意见。但请注意，我们的决定是最终的，您应自行承担因服务变更或终止而产生的任何损失。
        </p>
        <p class="mt-8">七、违约责任</p>
        <p>
          若您在使用我们的服务时违反了本协议的规定，我们有权采取警告、限制功能、暂停服务、终止服务、追究法律责任等措施。
        </p>
        <p>若我们的服务因您的过错而遭受损失，您应承担相应的赔偿责任。</p>
        <p class="mt-8">八、争议解决</p>
        <p>
          本协议的解释、效力及争议解决均适用中华人民共和国法律。若因本协议引起的或与本协议有关的任何争议，双方应首先通过友好协商解决；协商不成的，任何一方均有权向有管辖权的法院提起诉讼。
        </p>`
    }
  }
}
